 # План автоматизации:

## Перечень автоматизируемых сценариев:
### Позитивные:

1.Успешная покупка тура с оплатой по дебетовой карте;

2.Успешная покупка тура с использованием кредита;

3.Корректная запись результата успешной транзакции в СУБД (MySQL и PostgreSQL);

### Негативные:

1.Покупка тура с отклонённой картой;

2.Попытка покупки с некорректным номером карты;

3.Попытка покупки с пустым номером карты; 

4.Попытка покупки с просроченным годом;

5.Попытка покупки с просроченным годом; 

6.Попытка покупки с именем владельца на кириллице; 

7.Попытка покупки с именем владельца с цифрами; 

8.Попытка покупки с именем владельца со специальными символами; 

9.Попытка покупки с пустым именем владельца;

10.Попытка покупки с двумя CVC;

11.Попытка покупки с пустым CVC;

12.Попытка покупки с CVC со спецсимволами; 

13.Попытка покупки с пустыми полями.




## Перечень используемых инструментов:

1. IntelliJ IDEA - среда разработки программного обеспечения для написания кода;

2. JUnit 5 — фреймворк для написания тестов;

3. Java 11 - язык для написания авто-тестов;

4. Gradle — управление зависимостями и запуском тестов;

5. Selenide - фреймворк для автоматизированного тестирования веб-приложений на основе Selenium WebDriver;

6.  Docker - платформа для разработки и запуска контейнеров;

7.  Allure — визуализация отчётов о тестировании.


## Перечень и описание возможных рисков при автоматизации:

1. Нестабильность тестового окружения;

2. Сложности с тестированием кредитного сценария;

3. Отсутствие полных требований и документации;

4. Неполное покрытие функциональности;

5. Проблемы с интеграцией систем.


## Интервальная оценка с учётом рисков в часах:

1. Подготовка окружения (Docker, настройки) - 6-8 часов;

2. Написание позитивных тестов - 5-7 часов;

3. Написание негативных тестов - 6-8 часов;

4. Подключение и настройка Allure - 4-6 часов;

5. Формирование и анализ отчетов - 4-6 часов.

## План сдачи работ:

1. Тесты - 22.05.2025;
2. Результаты - 26.06.2025.
